package com.company;

/**
 * Created by user on 25.07.2017
 * Два прожектора треугольной формы образуют на стене два пятна, одно - голубого, а второе – желтого цвета.
 * Определить площадь пятна зеленого цвета, которое получится при наложении двух пятен и форму (количество вершин)
 * зеленого пятна. В первой строке содержатся координаты одного пятна: x11, y11, x12, y12, x13, y13, а во второй –
 * такие же координаты вершин второго пятна x21, y21, x22, y22, x23, y23. Известно, что -100 ≤ xi, yi ≤ 100.
 */
public class GreenSpot {
    static int getNumberOfPoints(int x11, int y11, int y12, int x13, int y13) {
        return 1;
    }

    static double getSquare() {
        return 1;
    }
}
